tutorials/lagrangian/sprayFoam/aachenBomb/constant/sprayCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      SprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection on;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            hs              explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu              cell;
        T               cell;
        Cp              cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}


constantProperties
{
    parcelTypeId    1;

    rhoMin          1e-15;
    TMin            200;
    pMin            1000;
    minParticleMass 1e-15;

    rho0            1000;
    T0              300;
    Cp0             4187;

    youngsModulus   1e9;
    poissonsRatio   0.35;

    epsilon0        1;
    f0              0.5;
    Pr              0.7;
    Tvap            273;
    Tbp             373;

    constantVolume  false;
}


subModels
{
    particleForces
    {
        sphereDrag;
    }

    injectionModel  coneNozzleInjection;

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    heatTransferModel RanzMarshall;

    compositionModel singlePhaseMixture;

    phaseChangeModel liquidEvaporation;

    surfaceFilmModel none;

    atomizationModel none;

    breakupModel    PilchErdman;

    stochasticCollisionModel none;

    radiation       off;

    coneNozzleInjectionCoeffs
    {
        SOI             0;
        massTotal       6.0e-6;
        parcelBasisType mass;
        injectionMethod disc;
        flowType        flowRateAndDischarge;
        outerDiameter   1.9e-4;
        innerDiameter   0;
        duration        1.25e-3;
        position        ( 0 0.0995 0 );
        direction       ( 0 -1 0 );
        parcelsPerSecond 100000000;
        flowRateProfile table
        (
            (0 0.1272)
            (4.16667e-05 6.1634)
            (8.33333e-05 9.4778)
            (0.000125 9.5806)
            (0.000166667 9.4184)
            (0.000208333 9.0926)
            (0.00025 8.7011)
            (0.000291667 8.2239)
            (0.000333333 8.0401)
            (0.000375 8.845)
            (0.000416667 8.9174)
            (0.000458333 8.8688)
            (0.0005 8.8882)
            (0.000541667 8.6923)
            (0.000583333 8.0014)
            (0.000625 7.2582)
            (0.000666667 7.2757)
            (0.000708333 6.968)
            (0.00075 6.7608)
            (0.000791667 6.6502)
            (0.000833333 6.7695)
            (0.000875 5.5774)
            (0.000916667 4.8649)
            (0.000958333 5.0805)
            (0.001 4.9547)
            (0.00104167 4.5613)
            (0.00108333 4.4536)
            (0.001125 5.2651)
            (0.00116667 5.256)
            (0.00120833 5.1737)
            (0.00125 3.9213)
        );

        Cd              constant 0.85;

        thetaInner      constant 0.0;
        thetaOuter      constant 10.0;

        sizeDistribution
        {
            type            uniform;

            uniformDistribution
            {
                minValue        1.0e-4;
                maxValue        1.1e-4;
            }

        }
    }

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  true;
    }

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
                C7H16               1;
            }
        );
    }

    liquidEvaporationCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids    ( C7H16 );
    }

    PilchErdmanCoeffs
    {
        solveOscillationEq false;
        B1              0.375;
        B2              0.236;
    }
}


cloudFunctions
{}


// ************************************************************************* //
